In [2]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
num_ser = pd.Series([4, 8, 15, 16, 23, 42])

In [4]:
num_ser

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
type(num_ser)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
my_list = [1,2,3,4,"Ashish","pwskills",2.6,3.4,True,"data"]
my_list
my_list_series = pd.Series(my_list)
print(my_list_series)
type(my_list_series)

0           1
1           2
2           3
3           4
4      Ashish
5    pwskills
6         2.6
7         3.4
8        True
9        data
dtype: object

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:

In [11]:
data = [["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
my_df = pd.DataFrame(data,columns=["Name","Age","Gender"])
my_df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is two-dimensional tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.It onsists of  data, rows, and columns. It is heterogenic in nature and can have columns with different data types.

Series is a one-dimensional data structure capable of holding data of any type (integer, string, float, python objects, etc.).All the elements of series should be of same data type sop its homogeneous.

In [11]:
#Data Frame Example
data = [["Alice",25,"Female"],["Bob",30,"Male"],["Claire",27,"Female"]]
my_df = pd.DataFrame(data,columns=["Name","Age","Gender"])
print("Data Frame Example")
print(my_df)
print("\n")
#Series Example
num_ser = pd.Series([4, 8, 15, 16, 23, 42])
print("Series Example")
print(num_ser)

Data Frame Example
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female


Series Example
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [13]:
#To fetch top 2 rown from dataframe
my_df.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [14]:
#To fetch bottom 1 rown from dataframe
my_df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [19]:
#To fetch datattypes from dataframe
my_df.dtypes

Name      object
Age        int64
Gender    object
dtype: object

In [20]:
#To fetch one column from dataframe
my_df["Name"]

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [21]:
#To fetch multiple column from dataframe
my_df[["Name","Age"]]

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Data Frame and panel are both size and data mutable while Series is data butable by size Immutable(size cannot be changed)

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
#Define Data
names = ["Alice","Bob","Claire"]
age = [25,30,27]
gender = ["Female","Male","Female"]

#Create Series of each data above
name_series = pd.Series(names)
age_series = pd.Series(age)
gender_series = pd.Series(gender)

#Use Series created above to create dataframe.
final_df = pd.DataFrame({
    "Name" : name_series,
    "Age" : age_series,
    "Gender" : gender_series
})

final_df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female